In [1]:
import pandas as pd

In [2]:
x = [1,3,5.5,"ABC","EFG",True]
x1 = pd.Series(x)
x1

0       1
1       3
2     5.5
3     ABC
4     EFG
5    True
dtype: object

In [3]:
y = [1,3,5.5,"ABC","EFG"]
y1 = pd.Series(y)
y1

0      1
1      3
2    5.5
3    ABC
4    EFG
dtype: object

In [4]:
z = [1,3,5.5,"ABC","EFG",True]
z1 = pd.Series(z)
z1

0       1
1       3
2     5.5
3     ABC
4     EFG
5    True
dtype: object

In [5]:
a = [1,2,3,4,55,6]
a1 = pd.Series(a)
a1

0     1
1     2
2     3
3     4
4    55
5     6
dtype: int64

In [6]:
name = pd.Series(["ABC","DEF","GHI","HIJ"], index=["10","20","30","40"])
name

10    ABC
20    DEF
30    GHI
40    HIJ
dtype: object

In [9]:
data = {
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 30, 22],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
df

    Name  Age         City
0   John   25     New York
1  Alice   30  Los Angeles
2    Bob   22      Chicago

In [15]:
data1 = [['John', 50, 'austin', 70],['matt', 30, 'boston', 95],['Bob', 40, 'New York', 80]]
df1 = pd.DataFrame(data1, columns=["Name","Age",'City',"Marks"])
df1

   Name  Age      City  Marks
0  John   50    austin     70
1  matt   30    boston     95
2   Bob   40  New York     80

In [21]:
data2 = {
    'Product': ['ball', 'stumps', 'helmet','specs'],
    'Price': [100,200,300,50],
    'InStock': [True,False,True,False]
}
df = pd.DataFrame(data2,index=['p1','p2','p3','p4'])
df

   Product  Price  InStock
p1    ball    100     True
p2  stumps    200    False
p3  helmet    300     True
p4   specs     50    False